Repository: LeoZhou1205/WeighPoint
Catalog: WeighPoint/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ kcal
zh_hans: %@ 千卡

source: A typical healthy BMI is between 18.5 and 24.9, but everyone's body is different
zh_hans: 健康的标准 BMI 通常在 18.5 到 24.9 之间，但每个人的身体都是不同的。

source: About This Plan
zh_hans: 关于此计划

source: About This Section
zh_hans: 关于此内容

source: absolutely crushing it!
zh_hans: 干得漂亮！

# Achieved: %@ %@
source: Achieved: %1$@ %2$@
zh_hans: 达到的：%1$@ %2$@

source: age
zh_hans: 年龄

source: Age
zh_hans: 年龄

source: AI features provided by Google Cloud AI
zh_hans: AI功能由Google Cloud AI提供

source: AI Insight
zh_hans: 智能分析

source: Apple Health Integration
zh_hans: 连接Apple健康

source: Average
zh_hans: 平均值

source: Average BMI
zh_hans: 平均BMI

source: Average weight
zh_hans: 平均体重

source: Balanced
zh_hans: 平衡

source: Before we start, these details will help us create useful predictions.
zh_hans: 在开始之前，这些信息将帮助我们生成有用的预测结果。

source: But don't pack your bags, it's 900°F there and rains sulfuric acid!
zh_hans: 不过别急着收拾行李，那里的温度高达华氏 900 度，还会下硫酸雨！

source: Calculate BMI
zh_hans: 计算BMI

source: Cancel
zh_hans: 取消

source: Connect
zh_hans: 连接

source: Connect to Apple Health so that we can use your sleep and workout records to tailor better weight management advices. Your data might be shared with a third party AI model provider
zh_hans: 连接 Apple 健康，以便我们根据您的睡眠和运动记录，为您量身定制更科学的体重管理建议。

source: Date
zh_hans: 日期

source: Done
zh_hans: 确认

source: E.g. %@ hours of jogging, or whichever sport you love
zh_hans: 例如%@小时的慢跑，或你喜欢的任何运动

source: E.g. %lld plates of Caesar Salad or %lld chicken burritos
zh_hans: 比如%lld 盘凯撒沙拉或者 %lld个鸡肉卷

source: Eat Less
zh_hans: 减少摄入

source: Edit
zh_hans: 编辑

source: Enable
zh_hans: 启用

source: Enable AI to get smarter and more personal advices
zh_hans: 启用AI以获得更加个性化的建议

source: Exercise:
zh_hans: 锻炼：

source: Feet
zh_hans: 英尺

source: Female
zh_hans: 女性

source: Gender
zh_hans: 性别

source: Goal %@%@
zh_hans: 目标%1$@%2$@

source: Goal Line
zh_hans: 显示目标

# Goal: %@ %@
source: Goal: %1$@ %2$@
zh_hans: 目标：%1$@ %2$@

# Goal: %@ kg by %@
source: Goal: %1$@ kg by %2$@
zh_hans: 目标：在 %2$@ 前达到 %1$@ 公斤

source: Goals
zh_hans: 目标

source: HealthKit Related
zh_hans: HealthKit相关

source: Height
zh_hans: 身高

source: History
zh_hans: 历史

source: Inches
zh_hans: 英寸

source: Input not valid
zh_hans: 输入有误：（

source: Intake:
zh_hans: 摄入：

source: Jupiter
zh_hans: 木星

source: keep it up!
zh_hans: 继续保持！

source: Keep Tracking Your Health
zh_hans: 继续追踪你的健康

source: Learn more about how this plan is generated
zh_hans: 了解您的计划是如何生成的

source: Learn more about how this section is generated
zh_hans: 了解生成原理

source: Learn more about how we create your plan
zh_hans: 了解我们如何制定您的计划

source: Let’s define your goal and help you with daily food and activity tips.
zh_hans: 让我们一起设定你的目标，并为你提供每日饮食和运动建议。

source: Let’s make your goal healthier. Your current plan results in too few daily calories to safely support your body. Try a more gradual timeline for better, lasting results.
zh_hans: 让我们一起制定一个更健康的目标。你当前的计划导致每日摄入热量过低，可能无法安全地支持身体运作。建议尝试更循序渐进的时间表，以获得更持久的成果。

source: Light enough to win every high jump competition… and maybe float away if you're not careful
zh_hans: 轻到可以拿下所有跳高比赛的冠军……不过要小心，可能一不小心就飘走了！

source: Log
zh_hans: 记录

source: Male
zh_hans: 男性

source: Manage
zh_hans: 管理

source: Manage my data
zh_hans: 管理我的数据

source: Mars
zh_hans: 火星

source: Max
zh_hans: 最高值

source: Max: %@ %@
zh_hans: 最高：%1$@ %2$@

source: Min
zh_hans: 最低值

source: Min: %@ %@
zh_hans: 最低：%1$@ %2$@

source: Move More
zh_hans: 增加运动

source: My Data
zh_hans: 我的数据

source: My Goal
zh_hans: 我的目标

source: Normal weight
zh_hans: 正常

source: Obese
zh_hans: 肥胖

source: OK
zh_hans: 好的

source: Overweight
zh_hans: 超重

source: Personal
zh_hans: 个人

source: Pick Date
zh_hans: 选择日期

source: Preferred Strategy
zh_hans: 首选方式

source: Progress So Far
zh_hans: 目前进展

source: Rather not say
zh_hans: 不便透露

source: Reach by
zh_hans: 达成日期

source: Records
zh_hans: 记录

source: Review Our Privacy Policy
zh_hans: 查看隐私政策

source: Select date
zh_hans: 选择日期

source: Skip
zh_hans: 跳过

source: So heavy you'd need a crane just to get out of bed! Good thing it's mostly gas.
zh_hans: 重得连下床都得靠吊车！还好它主要是气体组成。

source: Target
zh_hans: 目标

source: Target Weight
zh_hans: 目标体重

source: This is an evidence-based estimate, not a medical plan. For personalized advice, consult a healthcare professional.
zh_hans: 这是基于数据的估算结果，并非医疗方案。如需个性化建议，请咨询医疗专业人士。

source: This is based on rough estimates. For a more accurate result, consider providing your age and gender. Your data will be securely stored on your device or in iCloud.
zh_hans: 当前结果为粗略估算。填写年龄和性别可以让结果更准确。你的数据只会保存在设备或 iCloud 中，确保隐私安全。

source: This section is AI generated, and can sometimes produce inaccurate information
zh_hans: 内容由 AI 生成，可能存在偏差，仅供参考

source: Today's Target
zh_hans: 今日目标

source: Underweight
zh_hans: 偏瘦

source: Unknown BMI Range
zh_hans: 无法识别的BMI范围

source: Unsupported Insight
zh_hans: 当前不支持此项洞察

source: Venus
zh_hans: 金星

source: We need a bit more data before we can offer insights. Keep logging your records to unlock personalized trends!
zh_hans: 我们还需要更多数据，才能为你提供洞察分析。继续记录，解锁专属趋势！

source: Weight
zh_hans: 体重

source: What to prioritize today
zh_hans: 今日重点

source: You can edit your goal to fine-tune your daily food and activity tips.
zh_hans: 你可以编辑目标，以微调每日的饮食与运动建议

# You reached %lld%% of your goal - %@
source: You reached %1$lld%% of your goal - %2$@
zh_hans: 你已达成目标的 %1$lld%% —— %2$@

source: Your height
zh_hans: 你的身高

source: Your Latest BMI
zh_hans: 最近的BMI

source: Your weight
zh_hans: 你的体重

source: Your Weight on %@
zh_hans: %@上的体重
